select *
from پرداخت
where پرداخت.نوع like 'C%';

select sum(رزرو.مبلغ) as جمع_دریافتی_اتاق_هتل
from رزرو

select *
from پذیرش
order by پذیرش.[کل پرداختی] DESC;

select پرداخت.[کد ملی], sum(پرداخت.مبلغ) as پرداخت_کل
from پرداخت
group by پرداخت.[کد ملی];

select مسافر.نام , مسافر.[نام خانوادگی] , همراه.نام , همراه.[نام خانوادگی]
from مسافر
join همراه
on مسافر.[کد ملی] = همراه.[کد ملی]
order by مسافر.[تعداد همراه];

select پرداخت.نوع, sum(پرداخت.مبلغ) as مجموع
from پرداخت
group by پرداخت.نوع
order by مجموع DESC;


select مسافر.نام , مسافر.[نام خانوادگی] , رزرو.[تاریخ ورود], رزرو.[تاریخ خروج], رزرو.[شماره اتاق]
from رزرو 
    inner join اتاق
	on رزرو.[شماره اتاق]=اتاق.[شماره اتاق]
	inner join مسافر
	    on مسافر.[کد ملی] = رزرو.[کد ملی];

